#### Imports

In [1]:
import pandas as pd
import numpy as np

#### In ADP Data

In [2]:
raw_adp_df = pd.read_excel('inputs/PunchSource2023.xlsx') #read in the excel, put into DF
raw_adp_df = raw_adp_df[['Last Name', 'First Name', 'Time In', 'Pay Code [Timecard]']]
raw_adp_df = raw_adp_df[raw_adp_df['Pay Code [Timecard]'] != "REGSAL"] #drop managers from the pay data
raw_adp_df.loc[:, 'Date'] = raw_adp_df['Time In'].dt.date #make it solely a date col
raw_adp_df.drop(columns=['Time In', 'Pay Code [Timecard]'], inplace=True)

In [36]:
raw_adp_df

        Last Name First Name        Date
0            Abam       Aria  2023-05-28
1            Abam       Aria  2023-05-29
2            Abam       Aria  2023-06-04
3            Abam       Aria  2023-06-20
4            Abam       Aria  2023-06-28
...           ...        ...         ...
8024  von Brachel     Elinor  2023-07-12
8025  von Brachel     Elinor  2023-07-15
8026  von Brachel     Elinor  2023-07-18
8027  von Brachel     Elinor  2023-07-20
8028  von Brachel     Elinor  2023-07-27

[7037 rows x 3 columns]

#### In Scheduler Data

In [3]:
raw_scheduler_df = pd.read_excel('inputs/SchedulerShifts2023.xlsx') #read in the excel, put into DF
raw_scheduler_df = raw_scheduler_df.drop(columns=["epoch_start_time", "cover_time"])

In [4]:
#can drop any rows that have cover_type full and role = 2 
# b/c cover_type full either means request in future or was not taken
# 2 = manager so not relevant 
raw_scheduler_df = raw_scheduler_df[~((raw_scheduler_df['role'] == 2.0) | 
                                      (raw_scheduler_df['cover_type'] == 'full'))]

raw_scheduler_df['start_time_est'] = raw_scheduler_df['start_time_est'].dt.date #convert to just date 
raw_scheduler_df['cover_time_est'] = raw_scheduler_df['cover_time_est'].dt.date #convert to just date

In [30]:
raw_scheduler_df

,assignee_name,role,start_time_est,coverer_name,cover_type,cover_time_est
0,Andrew DeKuyper,3.0,2023-06-25,NaN,none,NaT
1,Osias Williams,3.0,2023-05-29,NaN,none,NaT
2,Jacob Silber,3.0,2023-05-27,NaN,none,NaT
3,Kate Niccolai,3.0,2023-06-11,NaN,none,NaT
4,Zachary Liebman,3.0,2023-08-30,NaN,none,NaT
...,...,...,...,...,...,...
4915,Clayton Thomas,3.0,2023-09-02,NaN,none,NaT
4916,Clayton Thomas,3.0,2023-09-01,NaN,none,NaT
4917,Clayton Thomas,3.0,2023-08-30,NaN,none,NaT
4918,Clayton Thomas,3.0,2023-09-03,NaN,none,NaT
4919,Clayton Thomas,3.0,2023-09-04,NaN,none,NaT

#### Extract Coverer Data, Add to Bottom of DF, Split Names into First+Last

In [5]:
#extract the coverers to a new DF
cover_sch_df = raw_scheduler_df[raw_scheduler_df['cover_type'].isin(['before', 'after'])][['coverer_name', 'role', 'cover_time_est']]
cover_sch_df.rename(columns={'coverer_name': 'assignee_name', 'cover_time_est': 'start_time_est'}, inplace=True)

In [15]:
#combine the original DF with the coverer DF to make one final shift DF
all_sch_df = pd.concat([raw_scheduler_df, cover_sch_df], ignore_index=True)
all_sch_df.drop(columns=['role', 'coverer_name', 'cover_type', 'cover_time_est'], inplace=True) #drop unneeded columns

#split name into first and last
split_names = all_sch_df['assignee_name'].str.split()
all_sch_df['First Name'] = split_names.str[0]
all_sch_df['Last Name'] = split_names.str[1:].str.join(' ')
all_sch_df

          assignee_name start_time_est First Name  Last Name
0       Andrew DeKuyper     2023-06-25     Andrew   DeKuyper
1        Osias Williams     2023-05-29      Osias   Williams
2          Jacob Silber     2023-05-27      Jacob     Silber
3         Kate Niccolai     2023-06-11       Kate   Niccolai
4       Zachary Liebman     2023-08-30    Zachary    Liebman
...                 ...            ...        ...        ...
4691       Elle Cadigan     2023-06-30       Elle    Cadigan
4692        John Hickey     2023-07-08       John     Hickey
4693     Grace Pappolla     2023-07-22      Grace   Pappolla
4694  Michael Mattiassi     2023-08-11    Michael  Mattiassi
4695      Nikki Heifler     2023-08-08      Nikki    Heifler

[4696 rows x 4 columns]

#### Define Timeframe

In [79]:
start_date = pd.Timestamp('2023-06-01').date()
end_date = pd.Timestamp('2023-08-01').date()

sch_timeframe_df = all_sch_df[(all_sch_df['start_time_est'] >= start_date) & 
                              (all_sch_df['start_time_est'] <= end_date)]

adp_timeframe_df = raw_adp_df[(raw_adp_df['Date'] >= start_date) & 
                              (raw_adp_df['Date'] <= end_date)]

In [80]:
sch_timeframe_df

         assignee_name start_time_est First Name Last Name
0      Andrew DeKuyper     2023-06-25     Andrew  DeKuyper
3        Kate Niccolai     2023-06-11       Kate  Niccolai
5        Joseph Pierro     2023-07-04     Joseph    Pierro
7       Carter Pierson     2023-07-02     Carter   Pierson
9        Natalie Tango     2023-06-15    Natalie     Tango
...                ...            ...        ...       ...
4687   Billie Sherratt     2023-07-20     Billie  Sherratt
4690  Catherine Ritter     2023-06-17  Catherine    Ritter
4691      Elle Cadigan     2023-06-30       Elle   Cadigan
4692       John Hickey     2023-07-08       John    Hickey
4693    Grace Pappolla     2023-07-22      Grace  Pappolla

[2898 rows x 4 columns]

In [81]:
adp_timeframe_df

        Last Name First Name        Date
2            Abam       Aria  2023-06-04
3            Abam       Aria  2023-06-20
4            Abam       Aria  2023-06-28
5            Abam       Aria  2023-07-01
6            Abam       Aria  2023-07-03
...           ...        ...         ...
8024  von Brachel     Elinor  2023-07-12
8025  von Brachel     Elinor  2023-07-15
8026  von Brachel     Elinor  2023-07-18
8027  von Brachel     Elinor  2023-07-20
8028  von Brachel     Elinor  2023-07-27

[6251 rows x 3 columns]

#### Grouping - Count

In [82]:
sch_grouped_df = sch_timeframe_df.groupby(['Last Name', 'First Name']).size().reset_index(name='Sch_Count') #find count per person
sch_grouped_df = sch_grouped_df.sort_values(by='Last Name') #sort by last name
sch_grouped_df

     Last Name First Name  Sch_Count
0                   Conor          2
1                  Declan         33
2                   Elena         13
3                  Gianna          6
4                Giovanna         31
..         ...        ...        ...
282     reilly       Liam          3
283       rinn     Samuel         28
284  rodriguez     Jayden         20
285    stevens     connor          2
286     yu Lee       Ting          5

[287 rows x 3 columns]

In [83]:
adp_grouped_df = adp_timeframe_df.groupby(['Last Name', 'First Name']).size().reset_index(name='ADP_Count')
adp_grouped_df

       Last Name First Name  ADP_Count
0           Abam       Aria         10
1          Acken      Katie         25
2         Advani     Andrew          8
3      Alexander      Lukas         19
4    Alexopoulos       Drew         22
..           ...        ...        ...
485   Zebrauskas        Mia         16
486        Ziaee      Armin          6
487       Zinnie     Taylor         14
488        Zotos  Alexandra         19
489  von Brachel     Elinor         12

[490 rows x 3 columns]